app/controllers/students_controller.rb

  def show
    #will refer to students/:id implicitly defined as show
    @student = Student.new
    @student.first_name = "Daenerys"
    @student.last_name = "Targaryen"
    @student.save
---
SELECT "students".* FROM "students"
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Daenerys"], ["last_name", "Targaryen"], ["created_at", "2017-04-10 15:36:24.625556"], ["updated_at", "2017-04-10 15:36:24.625556"]]